app/controllers/users_controller.rb

  def signup
    user = User.create(user_creds)
---
INSERT INTO "users" ("email", "token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"