app/controllers/words_controller.rb

  def index
    # maybe use current_user.words?
    @words = current_user.words.all
---
SELECT "words".* FROM "words" WHERE "words"."user_id" = $1  [["user_id", 1]]

  def create
    # @word = Word.new(word_params)
    @word = current_user.words.build(word_params)
    if @word.save
---
INSERT INTO "words" ("form", "definition", "part_of_speech", "origin_lang", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @word.update(word_params)
---
UPDATE "words" SET "form" = $1, "definition" = $2, "part_of_speech" = $3, "origin_lang" = $4, "updated_at" = $5 WHERE "words"."id" = $6  [["form", "fffffff"], ["definition", "fffffffff"], ["part_of_speech", "fffffff"], ["origin_lang", "ffff"], ["updated_at", "2019-12-19 20:59:05.602083"], ["id", 2]]

  def set_word

    # @word = Word.find(params[:id])
    # get the word from current_users collection of words
    @word = current_user.words.find(params[:id])
---
SELECT  "words".* FROM "words" WHERE "words"."user_id" = $1 AND "words"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]